e-yes/nuttx/arch/risc-v/src/bl702/hardware/bl702_ef.h
/****************************************************************************
 * arch/risc-v/src/bl702/hardware/bl702_ef.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_RISCV_SRC_BL702_HARDWARE_BL702_EF_H
#define __ARCH_RISCV_SRC_BL702_HARDWARE_BL702_EF_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include "bl702_memorymap.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register offsets *********************************************************/

#define  BL702_EF_CFG_0_OFFSET               0x000000  /* ef_cfg_0 */
#define  BL702_EF_DBG_PWD_LOW_OFFSET         0x000004  /* ef_dbg_pwd_low */
#define  BL702_EF_DBG_PWD_HIGH_OFFSET        0x000008  /* ef_dbg_pwd_high */
#define  BL702_EF_ANA_TRIM_0_OFFSET          0x00000c  /* ef_ana_trim_0 */
#define  BL702_EF_SW_USAGE_0_OFFSET          0x000010  /* ef_sw_usage_0 */
#define  BL702_EF_WIFI_MAC_LOW_OFFSET        0x000014  /* ef_wifi_mac_low */
#define  BL702_EF_WIFI_MAC_HIGH_OFFSET       0x000018  /* ef_wifi_mac_high */
#define  BL702_EF_KEY_SLOT_0_W0_OFFSET       0x00001c  /* ef_key_slot_0_w0 */
#define  BL702_EF_KEY_SLOT_0_W1_OFFSET       0x000020  /* ef_key_slot_0_w1 */
#define  BL702_EF_KEY_SLOT_0_W2_OFFSET       0x000024  /* ef_key_slot_0_w2 */
#define  BL702_EF_KEY_SLOT_0_W3_OFFSET       0x000028  /* ef_key_slot_0_w3 */
#define  BL702_EF_KEY_SLOT_1_W0_OFFSET       0x00002c  /* ef_key_slot_1_w0 */
#define  BL702_EF_KEY_SLOT_1_W1_OFFSET       0x000030  /* ef_key_slot_1_w1 */
#define  BL702_EF_KEY_SLOT_1_W2_OFFSET       0x000034  /* ef_key_slot_1_w2 */
#define  BL702_EF_KEY_SLOT_1_W3_OFFSET       0x000038  /* ef_key_slot_1_w3 */
#define  BL702_EF_KEY_SLOT_2_W0_OFFSET       0x00003c  /* ef_key_slot_2_w0 */
#define  BL702_EF_KEY_SLOT_2_W1_OFFSET       0x000040  /* ef_key_slot_2_w1 */
#define  BL702_EF_KEY_SLOT_2_W2_OFFSET       0x000044  /* ef_key_slot_2_w2 */
#define  BL702_EF_KEY_SLOT_2_W3_OFFSET       0x000048  /* ef_key_slot_2_w3 */
#define  BL702_EF_KEY_SLOT_3_W0_OFFSET       0x00004c  /* ef_key_slot_3_w0 */
#define  BL702_EF_KEY_SLOT_3_W1_OFFSET       0x000050  /* ef_key_slot_3_w1 */
#define  BL702_EF_KEY_SLOT_3_W2_OFFSET       0x000054  /* ef_key_slot_3_w2 */
#define  BL702_EF_KEY_SLOT_3_W3_OFFSET       0x000058  /* ef_key_slot_3_w3 */
#define  BL702_EF_KEY_SLOT_4_W0_OFFSET       0x00005c  /* ef_key_slot_4_w0 */
#define  BL702_EF_KEY_SLOT_4_W1_OFFSET       0x000060  /* ef_key_slot_4_w1 */
#define  BL702_EF_KEY_SLOT_4_W2_OFFSET       0x000064  /* ef_key_slot_4_w2 */
#define  BL702_EF_KEY_SLOT_4_W3_OFFSET       0x000068  /* ef_key_slot_4_w3 */
#define  BL702_EF_KEY_SLOT_5_W0_OFFSET       0x00006c  /* ef_key_slot_5_w0 */
#define  BL702_EF_KEY_SLOT_5_W1_OFFSET       0x000070  /* ef_key_slot_5_w1 */
#define  BL702_EF_KEY_SLOT_5_W2_OFFSET       0x000074  /* ef_key_slot_5_w2 */
#define  BL702_EF_KEY_SLOT_5_W3_OFFSET       0x000078  /* ef_key_slot_5_w3 */
#define  BL702_EF_DATA_0_LOCK_OFFSET         0x00007c  /* ef_data_0_lock */

#define  BL702_EF_REG_KEY_SLOT_6_W0_OFFSET   0x000080  /* reg_key_slot_6_w0 */
#define  BL702_EF_REG_KEY_SLOT_6_W1_OFFSET   0x000084  /* reg_key_slot_6_w1 */
#define  BL702_EF_REG_KEY_SLOT_6_W2_OFFSET   0x000088  /* reg_key_slot_6_w2 */
#define  BL702_EF_REG_KEY_SLOT_6_W3_OFFSET   0x00008c  /* reg_key_slot_6_w3 */
#define  BL702_EF_REG_KEY_SLOT_7_W0_OFFSET   0x000090  /* reg_key_slot_7_w0 */
#define  BL702_EF_REG_KEY_SLOT_7_W1_OFFSET   0x000094  /* reg_key_slot_7_w1 */
#define  BL702_EF_REG_KEY_SLOT_7_W2_OFFSET   0x000098  /* reg_key_slot_7_w2 */
#define  BL702_EF_REG_KEY_SLOT_7_W3_OFFSET   0x00009c  /* reg_key_slot_7_w3 */
#define  BL702_EF_REG_KEY_SLOT_8_W0_OFFSET   0x0000a0  /* reg_key_slot_8_w0 */
#define  BL702_EF_REG_KEY_SLOT_8_W1_OFFSET   0x0000a4  /* reg_key_slot_8_w1 */
#define  BL702_EF_REG_KEY_SLOT_8_W2_OFFSET   0x0000a8  /* reg_key_slot_8_w2 */
#define  BL702_EF_REG_KEY_SLOT_8_W3_OFFSET   0x0000ac  /* reg_key_slot_8_w3 */
#define  BL702_EF_REG_KEY_SLOT_9_W0_OFFSET   0x0000b0  /* reg_key_slot_9_w0 */
#define  BL702_EF_REG_KEY_SLOT_9_W1_OFFSET   0x0000b4  /* reg_key_slot_9_w1 */
#define  BL702_EF_REG_KEY_SLOT_9_W2_OFFSET   0x0000b8  /* reg_key_slot_9_w2 */
#define  BL702_EF_REG_KEY_SLOT_9_W3_OFFSET   0x0000bc  /* reg_key_slot_9_w3 */
#define  BL702_EF_REG_KEY_SLOT_10_W0_OFFSET  0x0000c0  /* reg_key_slot_10_w0 */
#define  BL702_EF_REG_KEY_SLOT_10_W1_OFFSET  0x0000c4  /* reg_key_slot_10_w1 */
#define  BL702_EF_REG_KEY_SLOT_10_W2_OFFSET  0x0000c8  /* reg_key_slot_10_w2 */
#define  BL702_EF_REG_KEY_SLOT_10_W3_OFFSET  0x0000cc  /* reg_key_slot_10_w3 */
#define  BL702_EF_REG_KEY_SLOT_11_W0_OFFSET  0x0000d0  /* reg_key_slot_11_w0 */
#define  BL702_EF_REG_KEY_SLOT_11_W1_OFFSET  0x0000d4  /* reg_key_slot_11_w1 */
#define  BL702_EF_REG_KEY_SLOT_11_W2_OFFSET  0x0000d8  /* reg_key_slot_11_w2 */
#define  BL702_EF_REG_KEY_SLOT_11_W3_OFFSET  0x0000dc  /* reg_key_slot_11_w3 */
#define  BL702_EF_REG_DATA_1_LOCK_OFFSET     0x0000e0  /* reg_data_1_lock */

#define  BL702_EF_IF_CTRL_0_OFFSET           0x000800  /* ef_if_ctrl_0 */
#define  BL702_EF_IF_CYC_0_OFFSET            0x000804  /* ef_if_cyc_0 */
#define  BL702_EF_IF_CYC_1_OFFSET            0x000808  /* ef_if_cyc_1 */
#define  BL702_EF_IF_0_MANUAL_OFFSET         0x00080c  /* ef_if_0_manual */
#define  BL702_EF_IF_0_STATUS_OFFSET         0x000810  /* ef_if_0_status */
#define  BL702_EF_IF_CFG_0_OFFSET            0x000814  /* ef_if_cfg_0 */
#define  BL702_EF_SW_CFG_0_OFFSET            0x000818  /* ef_sw_cfg_0 */
#define  BL702_EF_RESERVED_OFFSET            0x00081c  /* ef_reserved */
#define  BL702_EF_IF_ANA_TRIM_0_OFFSET       0x000820  /* ef_if_ana_trim_0 */
#define  BL702_EF_IF_SW_USAGE_0_OFFSET       0x000824  /* ef_if_sw_usage_0 */
#define  BL702_EF_CRC_CTRL_0_OFFSET          0x000a00  /* ef_crc_ctrl_0 */
#define  BL702_EF_CRC_CTRL_1_OFFSET          0x000a04  /* ef_crc_ctrl_1 */
#define  BL702_EF_CRC_CTRL_2_OFFSET          0x000a08  /* ef_crc_ctrl_2 */
#define  BL702_EF_CRC_CTRL_3_OFFSET          0x000a0c  /* ef_crc_ctrl_3 */
#define  BL702_EF_CRC_CTRL_4_OFFSET          0x000a10  /* ef_crc_ctrl_4 */
#define  BL702_EF_CRC_CTRL_5_OFFSET          0x000a14  /* ef_crc_ctrl_5 */

/* Register definitions *****************************************************/

#define  BL702_EF_CFG_0          ( BL702_EF_BASE +  BL702_EF_CFG_0_OFFSET)
#define  BL702_EF_DBG_PWD_LOW    ( BL702_EF_BASE +  BL702_EF_DBG_PWD_LOW_OFFSET)
#define  BL702_EF_DBG_PWD_HIGH   ( BL702_EF_BASE +  BL702_EF_DBG_PWD_HIGH_OFFSET)
#define  BL702_EF_ANA_TRIM_0     ( BL702_EF_BASE +  BL702_EF_ANA_TRIM_0_OFFSET)
#define  BL702_EF_SW_USAGE_0     ( BL702_EF_BASE +  BL702_EF_SW_USAGE_0_OFFSET)
#define  BL702_EF_WIFI_MAC_LOW   ( BL702_EF_BASE +  BL702_EF_WIFI_MAC_LOW_OFFSET)
#define  BL702_EF_WIFI_MAC_HIGH  ( BL702_EF_BASE +  BL702_EF_WIFI_MAC_HIGH_OFFSET)
#define  BL702_EF_KEY_SLOT_0_W0  ( BL702_EF_BASE +  BL702_EF_KEY_SLOT_0_W0_OFFSET)
#define  BL702_EF_KEY_SLOT_0_W1  ( BL702_EF_BASE +  BL702_EF_KEY_SLOT_0_W1_OFFSET)
#define  BL702_EF_KEY_SLOT_0_W2  ( BL702_EF_BASE +  BL702_EF_KEY_SLOT_0_W2_OFFSET)
#define  BL702_EF_KEY_SLOT_0_W3  ( BL702_EF_BASE +  BL702_EF_KEY_SLOT_0_W3_OFFSET)
#define  BL702_EF_KEY_SLOT_1_W0  ( BL702_EF_BASE +  BL702_EF_KEY_SLOT_1_W0_OFFSET)
#define  BL702_EF_KEY_SLOT_1_W1  ( BL702_EF_BASE +  BL702_EF_KEY_SLOT_1_W1_OFFSET)
#define  BL702_EF_KEY_SLOT_1_W2  ( BL702_EF_BASE +  BL702_EF_KEY_SLOT_1_W2_OFFSET)
#define  BL702_EF_KEY_SLOT_1_W3  ( BL702_EF_BASE +  BL702_EF_KEY_SLOT_1_W3_OFFSET)
#define  BL702_EF_KEY_SLOT_2_W0  ( BL702_EF_BASE +  BL702_EF_KEY_SLOT_2_W0_OFFSET)
#define  BL702_EF_KEY_SLOT_2_W1  ( BL702_EF_BASE +  BL702_EF_KEY_SLOT_2_W1_OFFSET)
#define  BL702_EF_KEY_SLOT_2_W2  ( BL702_EF_BASE +  BL702_EF_KEY_SLOT_2_W2_OFFSET)
#define  BL702_EF_KEY_SLOT_2_W3  ( BL702_EF_BASE +  BL702_EF_KEY_SLOT_2_W3_OFFSET)
#define  BL702_EF_KEY_SLOT_3_W0  ( BL702_EF_BASE +  BL702_EF_KEY_SLOT_3_W0_OFFSET)
#define  BL702_EF_KEY_SLOT_3_W1  ( BL702_EF_BASE +  BL702_EF_KEY_SLOT_3_W1_OFFSET)
#define  BL702_EF_KEY_SLOT_3_W2  ( BL702_EF_BASE +  BL702_EF_KEY_SLOT_3_W2_OFFSET)
#define  BL702_EF_KEY_SLOT_3_W3  ( BL702_EF_BASE +  BL702_EF_KEY_SLOT_3_W3_OFFSET)
#define  BL702_EF_KEY_SLOT_4_W0  ( BL702_EF_BASE +  BL702_EF_KEY_SLOT_4_W0_OFFSET)
#define  BL702_EF_KEY_SLOT_4_W1  ( BL702_EF_BASE +  BL702_EF_KEY_SLOT_4_W1_OFFSET)
#define  BL702_EF_KEY_SLOT_4_W2  ( BL702_EF_BASE +  BL702_EF_KEY_SLOT_4_W2_OFFSET)
#define  BL702_EF_KEY_SLOT_4_W3  ( BL702_EF_BASE +  BL702_EF_KEY_SLOT_4_W3_OFFSET)
#define  BL702_EF_KEY_SLOT_5_W0  ( BL702_EF_BASE +  BL702_EF_KEY_SLOT_5_W0_OFFSET)
#define  BL702_EF_KEY_SLOT_5_W1  ( BL702_EF_BASE +  BL702_EF_KEY_SLOT_5_W1_OFFSET)
#define  BL702_EF_KEY_SLOT_5_W2  ( BL702_EF_BASE +  BL702_EF_KEY_SLOT_5_W2_OFFSET)
#define  BL702_EF_KEY_SLOT_5_W3  ( BL702_EF_BASE +  BL702_EF_KEY_SLOT_5_W3_OFFSET)
#define  BL702_EF_DATA_0_LOCK    ( BL702_EF_BASE +  BL702_EF_DATA_0_LOCK_OFFSET)

#define  BL702_EF_REG_KEY_SLOT_6_W0   ( BL702_EF_BASE +  BL702_EF_REG_KEY_SLOT_6_W0_OFFSET)
#define  BL702_EF_REG_KEY_SLOT_6_W1   ( BL702_EF_BASE +  BL702_EF_REG_KEY_SLOT_6_W1_OFFSET)
#define  BL702_EF_REG_KEY_SLOT_6_W2   ( BL702_EF_BASE +  BL702_EF_REG_KEY_SLOT_6_W2_OFFSET)
#define  BL702_EF_REG_KEY_SLOT_6_W3   ( BL702_EF_BASE +  BL702_EF_REG_KEY_SLOT_6_W3_OFFSET)
#define  BL702_EF_REG_KEY_SLOT_7_W0   ( BL702_EF_BASE +  BL702_EF_REG_KEY_SLOT_7_W0_OFFSET)
#define  BL702_EF_REG_KEY_SLOT_7_W1   ( BL702_EF_BASE +  BL702_EF_REG_KEY_SLOT_7_W1_OFFSET)
#define  BL702_EF_REG_KEY_SLOT_7_W2   ( BL702_EF_BASE +  BL702_EF_REG_KEY_SLOT_7_W2_OFFSET)
#define  BL702_EF_REG_KEY_SLOT_7_W3   ( BL702_EF_BASE +  BL702_EF_REG_KEY_SLOT_7_W3_OFFSET)
#define  BL702_EF_REG_KEY_SLOT_8_W0   ( BL702_EF_BASE +  BL702_EF_REG_KEY_SLOT_8_W0_OFFSET)
#define  BL702_EF_REG_KEY_SLOT_8_W1   ( BL702_EF_BASE +  BL702_EF_REG_KEY_SLOT_8_W1_OFFSET)
#define  BL702_EF_REG_KEY_SLOT_8_W2   ( BL702_EF_BASE +  BL702_EF_REG_KEY_SLOT_8_W2_OFFSET)
#define  BL702_EF_REG_KEY_SLOT_8_W3   ( BL702_EF_BASE +  BL702_EF_REG_KEY_SLOT_8_W3_OFFSET)
#define  BL702_EF_REG_KEY_SLOT_9_W0   ( BL702_EF_BASE +  BL702_EF_REG_KEY_SLOT_9_W0_OFFSET)
#define  BL702_EF_REG_KEY_SLOT_9_W1   ( BL702_EF_BASE +  BL702_EF_REG_KEY_SLOT_9_W1_OFFSET)
#define  BL702_EF_REG_KEY_SLOT_9_W2   ( BL702_EF_BASE +  BL702_EF_REG_KEY_SLOT_9_W2_OFFSET)
#define  BL702_EF_REG_KEY_SLOT_9_W3   ( BL702_EF_BASE +  BL702_EF_REG_KEY_SLOT_9_W3_OFFSET)
#define  BL702_EF_REG_KEY_SLOT_10_W0  ( BL702_EF_BASE +  BL702_EF_REG_KEY_SLOT_10_W0_OFFSET)
#define  BL702_EF_REG_KEY_SLOT_10_W1  ( BL702_EF_BASE +  BL702_EF_REG_KEY_SLOT_10_W1_OFFSET)
#define  BL702_EF_REG_KEY_SLOT_10_W2  ( BL702_EF_BASE +  BL702_EF_REG_KEY_SLOT_10_W2_OFFSET)
#define  BL702_EF_REG_KEY_SLOT_10_W3  ( BL702_EF_BASE +  BL702_EF_REG_KEY_SLOT_10_W3_OFFSET)
#define  BL702_EF_REG_KEY_SLOT_11_W0  ( BL702_EF_BASE +  BL702_EF_REG_KEY_SLOT_11_W0_OFFSET)
#define  BL702_EF_REG_KEY_SLOT_11_W1  ( BL702_EF_BASE +  BL702_EF_REG_KEY_SLOT_11_W1_OFFSET)
#define  BL702_EF_REG_KEY_SLOT_11_W2  ( BL702_EF_BASE +  BL702_EF_REG_KEY_SLOT_11_W2_OFFSET)
#define  BL702_EF_REG_KEY_SLOT_11_W3  ( BL702_EF_BASE +  BL702_EF_REG_KEY_SLOT_11_W3_OFFSET)
#define  BL702_EF_REG_DATA_1_LOCK     ( BL702_EF_BASE +  BL702_EF_REG_DATA_1_LOCK_OFFSET)

